


<center> <H1> <b>Data Analysis with Python </b><figure> </H1> </center>
<center> <H6>  </H6> </center>

# DataFrame

## What is DataFrame?

In [1]:
import pandas as pd #importation de la bibliotheque pandas

In [3]:
#dictionnaire nomé data
data={"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
      "score":[90,80,85,75,95,60,65],      
      "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
      "sex":["M","M","M","M","F","F","F"]}

In [4]:
df=pd.DataFrame(data)#transformation du dico data en dataframe

In [5]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [6]:
df=pd.DataFrame(data,columns=["sport","name","sex","score"])#inversement des éléments du dataframe
df

       sport     name sex  score
0  Wrestling     Bill   M     90
1   Football      Tom   M     80
2     Skiing      Tim   M     85
3   Swimming     John   M     75
4     Tennis     Alex   F     95
5     Karete  Vanessa   F     60
6    Surfing     Kate   F     65

In [9]:
df.head()#affichage des 5 premières valeurs

       sport  name sex  score
0  Wrestling  Bill   M     90
1   Football   Tom   M     80
2     Skiing   Tim   M     85
3   Swimming  John   M     75
4     Tennis  Alex   F     95

In [12]:
df.tail() #affichage des 5 dernières valeurs

      sport     name sex  score
2    Skiing      Tim   M     85
3  Swimming     John   M     75
4    Tennis     Alex   F     95
5    Karete  Vanessa   F     60
6   Surfing     Kate   F     65

In [14]:
df.tail(3)#affichage des 3 dernières valeurs

      name    sport sex  score
4     Alex   Tennis   F     95
5  Vanessa   Karete   F     60
6     Kate  Surfing   F     65

In [15]:
df.head(2)#lis les 2 prémières valeurs du dataframe

   name      sport sex  score
0  Bill  Wrestling   M     90
1   Tom   Football   M     80

In [14]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"])#ajouter le genre et l'age dans le dataframe mais n'ont pas des valeurs par defauts
df

      name      sport gender  score  age
0     Bill  Wrestling    NaN     90  NaN
1      Tom   Football    NaN     80  NaN
2      Tim     Skiing    NaN     85  NaN
3     John   Swimming    NaN     75  NaN
4     Alex     Tennis    NaN     95  NaN
5  Vanessa     Karete    NaN     60  NaN
6     Kate    Surfing    NaN     65  NaN

In [48]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"],#modification des index par defaut
                index=["one","two","three","four","five","six","seven"])
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90  NaN
two        Tom   Football    NaN     80  NaN
three      Tim     Skiing    NaN     85  NaN
four      John   Swimming    NaN     75  NaN
five      Alex     Tennis    NaN     95  NaN
six    Vanessa     Karete    NaN     60  NaN
seven     Kate    Surfing    NaN     65  NaN

In [82]:
df["age"]=18
df["gender"]="M"
df.loc["one",["name","age","gender"]]="Bella",10,"F"
df

          name      sport gender  score  age
one      Bella  Wrestling      F     90   10
two        Tom   Football      M     80   18
three      Tim     Skiing      M     85   18
four      John   Swimming      M     75   18
five      Alex     Tennis      M     95   18
six    Vanessa     Karete      M     60   18
seven     Kate    Surfing      M     65   18

In [83]:
#dic={'male':'one','male':'two','male':'three','male':'four','female':'five','femal':'six','female':'seven'}
df.loc["five":"seven",["gender"]]="F"
df

          name      sport gender  score  age
one      Bella  Wrestling      F     90   10
two        Tom   Football      M     80   18
three      Tim     Skiing      M     85   18
four      John   Swimming      M     75   18
five      Alex     Tennis      F     95   18
six    Vanessa     Karete      F     60   18
seven     Kate    Surfing      F     65   18

In [84]:
df["sport"]#extraire tous les elements de la colonne sport

one      Wrestling
two       Football
three       Skiing
four      Swimming
five        Tennis
six         Karete
seven      Surfing
Name: sport, dtype: object

In [85]:
my_columns=["name","sport"]#extraction des colonnes name et sport
df[my_columns]

          name      sport
one      Bella  Wrestling
two        Tom   Football
three      Tim     Skiing
four      John   Swimming
five      Alex     Tennis
six    Vanessa     Karete
seven     Kate    Surfing

In [86]:
df.sport

one      Wrestling
two       Football
three       Skiing
four      Swimming
five        Tennis
six         Karete
seven      Surfing
Name: sport, dtype: object

In [87]:
df.loc[["one"]]

      name      sport gender  score  age
one  Bella  Wrestling      F     90   10

In [88]:
df.loc[["one","two"]]

      name      sport gender  score  age
one  Bella  Wrestling      F     90   10
two    Tom   Football      M     80   18

In [89]:
df["age"]=18
df

          name      sport gender  score  age
one      Bella  Wrestling      F     90   18
two        Tom   Football      M     80   18
three      Tim     Skiing      M     85   18
four      John   Swimming      M     75   18
five      Alex     Tennis      F     95   18
six    Vanessa     Karete      F     60   18
seven     Kate    Surfing      F     65   18

In [91]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"], 
                index=["one","two","three","four","five","six","seven"])
values=[18,19,20,18,17,17,18]
df["age"]=values
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   18
two        Tom   Football    NaN     80   19
three      Tim     Skiing    NaN     85   20
four      John   Swimming    NaN     75   18
five      Alex     Tennis    NaN     95   17
six    Vanessa     Karete    NaN     60   17
seven     Kate    Surfing    NaN     65   18

In [92]:
genre=["male","male","male","male","female","female","female"]#preciser le genre 
df["gender"]= genre
df

          name      sport  gender  score  age
one       Bill  Wrestling    male     90   18
two        Tom   Football    male     80   19
three      Tim     Skiing    male     85   20
four      John   Swimming    male     75   18
five      Alex     Tennis  female     95   17
six    Vanessa     Karete  female     60   17
seven     Kate    Surfing  female     65   18

In [93]:
df["pass"]=df.score>=70
df

          name      sport  gender  score  age   pass
one       Bill  Wrestling    male     90   18   True
two        Tom   Football    male     80   19   True
three      Tim     Skiing    male     85   20   True
four      John   Swimming    male     75   18   True
five      Alex     Tennis  female     95   17   True
six    Vanessa     Karete  female     60   17  False
seven     Kate    Surfing  female     65   18  False

In [97]:
df[df.score>70]

       name      sport  gender  score  age  pass
one    Bill  Wrestling    male     90   18  True
two     Tom   Football    male     80   19  True
three   Tim     Skiing    male     85   20  True
four   John   Swimming    male     75   18  True
five   Alex     Tennis  female     95   17  True

In [98]:
df.loc[df['pass']==True, ['name','sport']]

       name      sport
one    Bill  Wrestling
two     Tom   Football
three   Tim     Skiing
four   John   Swimming
five   Alex     Tennis

In [99]:
del df["pass"]
df

          name      sport  gender  score  age
one       Bill  Wrestling    male     90   18
two        Tom   Football    male     80   19
three      Tim     Skiing    male     85   20
four      John   Swimming    male     75   18
five      Alex     Tennis  female     95   17
six    Vanessa     Karete  female     60   17
seven     Kate    Surfing  female     65   18

In [100]:
scores={"Math":{"A":85,"B":90,"C":95}, "Physics":{"A":90,"B":80,"C":75}}

In [101]:
scores_df=pd.DataFrame(scores)
scores_df

   Math  Physics
A    85       90
B    90       80
C    95       75

In [102]:
scores_df.T

          A   B   C
Math     85  90  95
Physics  90  80  75